{
  "basics": {
    "name": "Calvan Liang",
    "label": "Computer Science Graduate",
    "picture": "https://calvan-liang.github.io/images/Profile_Picture_Square.jpg",
    "email": "BusinessCalvan@gmail.com",
    "phone": "808-255-7737",
    "website": "https://calvan-liang.github.io",
    "summary": "I recently graduated from University of Hawaii at Manoa with a B.S. in Computer Science in Spring 2021. I enjoy learning different aspects of computing technology. My focus is computer operation, management, and maintenance. I also have interest in web design, development, and management.",
    "location": {
      "address": "1245 Maunakea St. Apt. 1110 ",
      "postalCode": "96817",
      "city": "Honolulu",
      "countryCode": "USA",
      "region": "Hawaii"
    },
    "profiles": [
      {
        "network": "github",
        "username": "calvan-liang",
        "url": "http://github.com/calvan-liang"
      },
      {
        "network": "linkedin",
        "username": "calvan_liang",
        "url": "http://www.linkedin.com/in/calvan-liang-52108416a"
      }
    ]
  },
  "interests": [
    {
      "name": "Computer Operations",
      "keywords": [
      ]
    },
    {
      "name": "Computer Management",
      "keywords": [
      ]
    },
    {
      "name": "Computer Maintenance",
      "keywords": [
      ]
    },
    {
      "name": "Web Development",
      "keywords": [
      ]
    },
    {
      "name": "Networking",
      "keywords": [
      ]
    }
  ],
  "skills": [
    {
      "name": "Languages and Frameworks",
      "level": "",
      "keywords": [
        "C",
        "C++",
        "Java",
        "Javascript",
        "HTML",
        "CSS"
      ]
    },
    {
      "name": "Toolsets/OS",
      "level": "",
      "keywords": [
        "Windows",
        "Linex",
        "GitHub",
        "IntelliJ IDEA",
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Hawaiʻi at Mānoa, B.S. Computer Science",
      "area": "Graduated in Spring 2021",
      "studyType": "GPA: 3.88",
      "startDate": "2017-08-20",
      "endDate": "2021-05-15",
      "gpa": "3.88",
      "courses": [
      ]
    }
  ],
  "work": [
    {
      "company": "Computer Laboratory Monitor",
      "position": "Center for Language & Technology",
      "website": "https://clt.manoa.hawaii.edu/",
      "startDate": "2017-08-27",
      "endDate": "2021-05-15",
      "summary": "Computer Lab Monitor for the Center for Language & Technology Computer Lab.",
      "highlights": [
        "Provide lab users assistance in operating the computers and equipment.",
        "Maintenance and management of lab equipment, such as computers, audio devices, projectors, and printers",
        "Troubleshoot and resolve various computer-related issues, of which could be hardware-related or software-related.",
        "Record number of users and their activities every hour.",
        "Organize, manage, and prepare for classes that reserve the lab for instruction purposes.",
        "Update and manage excel sheets regarding lab equipment status, upcoming reservations, and events.",
        "Communicate and converse with lab users and other Center for Language & Technology via phone calls and emails.",
        "Inform management of sudden or unexpected problems and emergencies",
        "When necessary, lead small workshops and demonstrations on how to use certain equipment and applications."
      ]
    }
  ],
  "volunteer": [
    {
      "organization": "Student and Intern",
      "website": "https://www.radgrad.org/summer2020.html",
      "position": "RadGrad Summer 2020 Internship",
      "endDate": "2020",
      "summary": "RadGrad is a project that intends to improve and aid students in their STEM career path. It helps students and aspiring STEM specialists by guiding them through their degree program and presenting them post-graduate opportunities.",
      "highlights": [
        "Part of the DevOps team for RadGrad",
        "Research project for a better hosting platform for RadGrad.",
        "Variables for research include performance, performance monitoring tools, scalability, and minimal cost trade-off (for performance).",
        "Extensive management of time and resources due to the scale of the project and limited time given."
      ]
    },
    {
      "organization": "Competitor",
      "website": "https://www.nationalccdc.org/",
      "position": "National Collegiate Cyber Defense Competition",
      "endDate": "2020",
      "summary": "Cyber defense competition where an eight person team work to secure eight computers. We are the 'blue' side, who are working to defend against the attacking 'red' side.",
      "highlights": [
        "Secure the computer from potential security threats under a time constraint.",
        "Find solutions to various problems posed by the current scenario."
      ]
    },
    {
      "organization": "Competitor",
      "website": "https://hacc.hawaii.gov/",
      "position": "Hawaii Annual Code Challenge",
      "endDate": "2020",
      "summary": "The 2020 Hawaii Annual Code Challenge (HACC) is a competition where participants use their knowledge, skills, and creativity to design a useful application that would benefit the people of Hawaii in some way.",
      "highlights": [
        "My team and I created a mobile app called Helping Hands. Helping Hands is a Hawaii State Resource Directory Application.",
        "It helps users who need assistance find resources or programs that can assist them with housing, food, and medical."
      ]
    }
  ],
  "awards": [
    {
      "title": "28th Annual Physics Olympics, 2017 Second Place Winner",
      "date": ,
      "awarder": ,
      "summary": "A competition that tested students' knowledge of physics through various problems and activities. My team and I placed second."
    }
  ],
  "references": [
    {
      "name": "Aki Kuwada, Secretary of the Center for Language & Technology,",
      "reference": "Phone: 808-956-5132"
    }
  ]
}
